data_generation/Training_Cases/Case3/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
130184
(
(-1.64973 0.00641723 0.003175)
(-1.64973 0.0065584 0.003175)
(-1.64973 0.00671369 0.003175)
(-1.64973 0.00688451 0.003175)
(-1.64973 0.00707241 0.003175)
(-1.64973 0.0072791 0.003175)
(-1.64973 0.00750646 0.003175)
(-1.64973 0.00775656 0.003175)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
78
(
(-1.651 0.00641723 0.003175)
(-1.651 0.0065584 0.003175)
(-1.651 0.00671369 0.003175)
(-1.651 0.00688451 0.003175)
(-1.651 0.00707241 0.003175)
(-1.651 0.0072791 0.003175)
(-1.651 0.00750646 0.003175)
(-1.651 0.00775656 0.003175)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0.635 0.114076 0.003175)
(0.635 0.113624 0.003175)
(0.635 0.113162 0.003175)
(0.635 0.112691 0.003175)
(0.635 0.112211 0.003175)
(0.635 0.111721 0.003175)
(0.635 0.111222 0.003175)
(0.635 0.110712 0.003175)
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<vector> 
1353
(
(0.000271892 0.1143 0.003175)
(0.000815677 0.1143 0.003175)
(0.00135946 0.1143 0.003175)
(0.00190325 0.1143 0.003175)
(0.00244703 0.1143 0.003175)
(0.00299081 0.1143 0.003175)
(0.0035346 0.1143 0.003175)
(0.00407838 0.1143 0.003175)
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<vector> 
1403
(
(-0.000317644 0.00635 0.003175)
(-0.000953366 0.00635 0.003175)
(-0.00158996 0.00635 0.003175)
(-0.00222742 0.00635 0.003175)
(-0.00286575 0.00635 0.003175)
(-0.00350495 0.00635 0.003175)
(-0.00414503 0.00635 0.003175)
(-0.00478598 0.00635 0.003175)
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
