data_generation/Training_Cases/Case3/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
130184
(
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1353
(
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1403
(
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
0.003175
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
