data_generation/Training_Cases/Case3/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
258787
(
-7.98239e-13
3.77363e-05
-4.61244e-12
4.151e-05
-8.79428e-12
4.5661e-05
-1.33697e-11
5.0227e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
-3.77363e-05
-4.151e-05
-4.5661e-05
-5.0227e-05
-5.52498e-05
-6.07747e-05
-6.68522e-05
-7.35374e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.00011874
0.000121115
0.000123538
0.000126008
0.000128528
0.000131099
0.000133721
0.000136395
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    upperWallStartup
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            empty;
        value           nonuniform 0();
    }
    front
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
