data_generation/Training_Cases/Case3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          78;
        startFace       258787;
    }
    outlet
    {
        type            patch;
        nFaces          128;
        startFace       258865;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          100;
        startFace       258993;
    }
    upperWallStartup
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          100;
        startFace       259093;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1353;
        startFace       259193;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1403;
        startFace       260546;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          130184;
        startFace       261949;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          130184;
        startFace       392133;
    }
)

// ************************************************************************* //
